Revit 2027 API
ParameterTypeId.FabricationPartDiameterInOption Property
 "Main Primary Diameter Option"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationPartDiameterInOption { get; }
Public Shared ReadOnly Property FabricationPartDiameterInOption As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationPartDiameterInOption {
	ForgeTypeId^ get ();
}
static member FabricationPartDiameterInOption : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace